# GetElementsWithOpenConnector Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter..::..GetElementsWithOpenConnector Method
DesignToFabricationConverter Class See Also
---
Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ISet<ElementId> GetElementsWithOpenConnector()
```

Visual Basic
---
```text
Public Function GetElementsWithOpenConnector As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetElementsWithOpenConnector()
```

# Remarks
This set of element identifiers is only available after the **Convert** method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace